In [32]:
import pandas as pd

**Basic info**

In [33]:
# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}
df = pd.DataFrame(data)

# Display the DataFrame
print(df)
print('======================================')
# Basic Info
print(df.info())       # Data types, non-null counts
print('======================================')
print(df.describe())   # Statistical summary
print('======================================')
print(df.shape)

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
======================================
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Salary  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
None
======================================
        Age   Salary
count   3.0      3.0
mean   30.0  60000.0
std     5.0  10000.0
min    25.0  50000.0
25%    27.5  55000.0
50%    30.0  60000.0
75%    32.5  65000.0
max    35.0  70000.0
======================================
(3, 3)

In [34]:
print(df["Age"].unique())
print("========================================")
print(df['Age'].value_counts())

[25 30 35]
========================================
Age
25    1
30    1
35    1
Name: count, dtype: int64

**Duplicate**

In [35]:
data1 = {
    'A': [1, 2, 2, 3, 4, 4, 5],
    'B': ['x', 'y', 'y', 'z', 'w', 'w', 'v']
}
df1 = pd.DataFrame(data1)

#Identify Duplicate Rows
print(df1.duplicated())  # True for duplicate rows
print("========================================")
# Find duplicate rows
duplicates = df1[df1.duplicated()]
print(duplicates)
print("========================================")
# Find count of duplicate rows
duplicates = df1[df1.duplicated()]
print(len(duplicates))
print("========================================")
# Drop duplicate rows, keeping the first occurrence
deduplicated_df = df1.drop_duplicates()
print(deduplicated_df)
print("========================================")
# Drop duplicates based on column 'A' only
deduplicated_subset_df = df1.drop_duplicates(subset=['A'])
print(deduplicated_subset_df)

0    False
1    False
2     True
3    False
4    False
5     True
6    False
dtype: bool
========================================
   A  B
2  2  y
5  4  w
========================================
2
========================================
   A  B
0  1  x
1  2  y
3  3  z
4  4  w
6  5  v
========================================
   A  B
0  1  x
1  2  y
3  3  z
4  4  w
6  5  v

**Reading Data**

In [36]:
# Reading data
'''
df_csv = pd.read_csv('data.csv')           # CSV
df_excel = pd.read_excel('data.xlsx')     # Excel
df_json = pd.read_json('data.json')       # JSON

# Writing data
df.to_csv('output.csv', index=False)
df.to_excel('output.xlsx', index=False)
df.to_json('output.json', orient='records')
'''

"\ndf_csv = pd.read_csv('data.csv')           # CSV\ndf_excel = pd.read_excel('data.xlsx')     # Excel\ndf_json = pd.read_json('data.json')       # JSON\n\n# Writing data\ndf.to_csv('output.csv', index=False)\ndf.to_excel('output.xlsx', index=False)\ndf.to_json('output.json', orient='records')\n"

**Selection on columns**

In [37]:
# Select column
print(df['Name'])
print('======================================')
# Select multiple columns
print(df[['Name', 'Salary']])
print('======================================')
# Conditional selection
print(df[df['Age'] > 25])
print('======================================')
print(df[['Name', 'Salary']][0:2])

0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
======================================
      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
======================================
      Name  Age  Salary
1      Bob   30   60000
2  Charlie   35   70000
======================================
    Name  Salary
0  Alice   50000
1    Bob   60000

**Selection of rows**

In [38]:
# Access a row by position
print(df.iloc[0])  # First row
print('======================================')
# Access multiple rows by positions
print(df.iloc[[0, 2]])
print('======================================')
# Access a range of rows (exclusive of end)
print(df.iloc[0:2])  # Rows 0 and 1
print('======================================')
# Access specific cells
print(df.iloc[0, 1])  # Value at first row, second column

Name      Alice
Age          25
Salary    50000
Name: 0, dtype: object
======================================
      Name  Age  Salary
0    Alice   25   50000
2  Charlie   35   70000
======================================
    Name  Age  Salary
0  Alice   25   50000
1    Bob   30   60000
======================================
25

**Adding columns**

In [39]:
# Add new column
df['Bonus'] = df['Salary'] * 0.1

# Drop a column
df = df.drop('Bonus', axis=1)  # axis=1 for column

**Missing values**

In [40]:
# Introduce missing data
df.loc[1, 'Age'] = None
print('======================================')
# Check for nulls
print(df.isnull())
print('======================================')
print(df.isnull().sum())
print('======================================')
# Fill missing values
df['Age'].fillna(df['Age'].mean(), inplace=True)
print(df)
# Drop rows with missing values
df.dropna(inplace=True)

======================================
    Name    Age  Salary
0  False  False   False
1  False   True   False
2  False  False   False
======================================
Name      0
Age       1
Salary    0
dtype: int64
======================================
      Name   Age  Salary
0    Alice  25.0   50000
1      Bob  30.0   60000
2  Charlie  35.0   70000

<ipython-input-40-b4d258251217>:10: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)

**Data transformation**

In [41]:
# Apply functions
df['Age'] = df['Age'].apply(lambda x: x + 1)
print(df)
print('======================================')

# Map values
df['Name'] = df['Name'].map({'Alice': 'Alicia', 'Bob': 'Robert'}).fillna(df['Name'])
print(df)
print('======================================')

# String operations
df['Name'] = df['Name'].str.upper()
print(df)

      Name   Age  Salary
0    Alice  26.0   50000
1      Bob  31.0   60000
2  Charlie  36.0   70000
======================================
      Name   Age  Salary
0   Alicia  26.0   50000
1   Robert  31.0   60000
2  Charlie  36.0   70000
======================================
      Name   Age  Salary
0   ALICIA  26.0   50000
1   ROBERT  31.0   60000
2  CHARLIE  36.0   70000

**Sorting and ranking**

In [42]:
# Sort by column
df.sort_values(by='Salary', ascending=False, inplace=True)
print(df)
print('======================================')
# Rank data
df['Rank'] = df['Salary'].rank(ascending=False)
print(df)

      Name   Age  Salary
2  CHARLIE  36.0   70000
1   ROBERT  31.0   60000
0   ALICIA  26.0   50000
======================================
      Name   Age  Salary  Rank
2  CHARLIE  36.0   70000   1.0
1   ROBERT  31.0   60000   2.0
0   ALICIA  26.0   50000   3.0

**Grouping and aggregation**

In [43]:
# Group by
data = {
    'Category': ['A', 'A', 'B', 'B', 'C'],
    'Sales': [100, 150, 200, 250, 300],
    'Region': ['North', 'South', 'North', 'South', 'North']
}
df = pd.DataFrame(data)

# Group by 'Category' and calculate total sales
grouped = df.groupby('Category')
print(grouped['Sales'].sum())

Category
A    250
B    450
C    300
Name: Sales, dtype: int64

In [44]:
grouped = df.groupby('Category')['Sales'].sum()
print(grouped)

Category
A    250
B    450
C    300
Name: Sales, dtype: int64

In [45]:
# Using groupby with agg for multiple aggregations
result = df.groupby('Category').agg({
    'Sales': ['sum', 'mean'],  # Aggregate sales
    'Region': 'count'         # Count occurrences
})
print(result)

         Sales        Region
           sum   mean  count
Category
A          250  125.0      2
B          450  225.0      2
C          300  300.0      1

**Merging and joining**

In [46]:
# Merging
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'Salary': [50000, 60000, 70000]
}
df = pd.DataFrame(data)

data2 = {'Name': ['Alice', 'Charlie'], 'Department': ['HR', 'Engineering']}
df2 = pd.DataFrame(data2)

merged = pd.merge(df, df2, on='Name', how='left')
print(merged)
print('======================================')

# Joining
df.set_index('Name', inplace=True)
df2.set_index('Name', inplace=True)
joined = df.join(df2, how='left')
print(joined)

      Name  Age  Salary   Department
0    Alice   25   50000           HR
1      Bob   30   60000          NaN
2  Charlie   35   70000  Engineering
======================================
         Age  Salary   Department
Name
Alice     25   50000           HR
Bob       30   60000          NaN
Charlie   35   70000  Engineering

**Time series operations**

In [47]:
# Convert to datetime
df['Join_Date'] = pd.to_datetime(['2021-01-01', '2022-06-15', '2023-03-20'])

# Extract year, month
df['Year'] = df['Join_Date'].dt.year
df['Month'] = df['Join_Date'].dt.month
print(df)

         Age  Salary  Join_Date  Year  Month
Name
Alice     25   50000 2021-01-01  2021      1
Bob       30   60000 2022-06-15  2022      6
Charlie   35   70000 2023-03-20  2023      3

**One Hot Encoding**

In [51]:
data = {
    'A': ['cat', 'dog', 'cat', 'bird', 'dog'],
    'B': ['red', 'blue', 'green', 'red', 'green'],
    'C': [1, 2, 3, 4, 5]
}
df = pd.DataFrame(data)

# Convert categorical columns into dummy variables
df_dummies=pd.get_dummies(df, columns=['A', 'B'], drop_first=True, dtype=int)
print(df_dummies)

   C  A_cat  A_dog  B_green  B_red
0  1      1      0        0      1
1  2      0      1        0      0
2  3      1      0        1      0
3  4      0      0        0      1
4  5      0      1        1      0